/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "\"%@\"";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "القيمة غير صالحة.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "القيمة \"%@\" غير صالحة.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "الرجاء توفير قيمة صالحة.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "القيمة غير صالحة.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "القيمة \"%@\" غير صالحة.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "حجم القيمة صغيرة جدًا.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "حجم القيمة كبيرة جدًا.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "الرجاء توفير قيمة صالحة.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "الرجاء توفير رقم لا يقل عن %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "الرجاء توفير رقم ما بين %1$@ و %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "الرجاء توفير رقم لا يزيد عن %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "حجم القيمة %@ صغيرة جدًا.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "حجم القيمة %@ كبيرة جدًا.";

/* NSFileLockingError */
"Err255-C" = "تعذر تأمين الملف.";

/* NSFileLockingError */
"Err255-R" = "ربما يكون الملف مؤمّنًا بالفعل، أو ربما لا يتوفر لديك الإذن لتأمينه.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "تعذر تأمين الملف \"%@\".";

/* NSFileReadUnknownError */
"Err256" = "تعذر فتح الملف.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "تعذر فتح الملف \"%@\".";

/* NSFileReadNoPermissionError */
"Err257" = "تعذر فتح الملف لأنه لا يوجد لديك الإذن لعرضه.";

/* NSFileReadNoPermissionError */
"Err257-C" = "لا يتوفر لديك الإذن.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "لعرض الأذونات أو تغييرها، حدد العنصر في Finder وقم باختيار الملف ثم إحضار المعلومات.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "تعذر فتح الملف \"%@\" لأنه لا يوجد لديك الإذن لعرضه.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "اسم الملف غير صالح.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "تعذر فتح العنصر نظرًا لأن اسم الملف \"%@\" غير صالح.";

/* NSFileReadCorruptFileError */
"Err259" = "تعذر فتح الملف حيث إنه ليس بالتنسيق الصحيح.";

/* NSFileReadCorruptFileError */
"Err259-C" = "الملف ليس بالتنسيق الصحيح.";

/* NSFileReadCorruptFileError */
"Err259-R" = "ربما يكون الملف تالفًا أو مقتطعًا أو بتنسيق غير متوقع.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "تعذر فتح الملف \"%@\" حيث إنه ليس بالتنسيق الصحيح.";

/* NSFileReadNoSuchFileError */
"Err260" = "تعذر فتح الملف لأنه غير موجود.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "المجلد \"%@\" غير موجود.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "الملف غير موجود.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "المجلد غير موجود.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "تعذر فتح الملف \"%@\" لأنه لا يوجد مثل هذا الملف.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "تعذر فتح الملف باستخدام ترميز النص المحدد.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "ترميز النص المحدد غير قابل للتطبيق.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "ترميز النص %@ غير قابل للتطبيق.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "ربما يكون الملف قد تم حفظه باستخدام ترميز نص مختلف، أو ربما لا يكون ملفًا نصيًا.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "تعذر فتح الملف باستخدام ترميز النص %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "تعذر فتح الملف \"%2$@\" باستخدام ترميز النص %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "تعذر فتح الملف حيث إن نوع عنوان URL المحدد غير مدعوم.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "نوع عنوان URL المحدد غير مدعوم.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "تعذر فتح الملف \"%1$@\" نظرًا لأن نوع عنوان URL المتمثل في %2$@ غير مدعوم.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "تعذر فتح الملف حيث إن نوع عنوان URL %@ غير مدعوم.";

/* NSFileReadTooLargeError */
"Err263" = "تعذر فتح الملف لأن حجمه كبير جدًا.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "حجم الملف كبير جدًا.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "تعذر فتح الملف \"%@\" لأن حجمه كبير جدًا.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "تعذر فتح الملف نظرًا لتعذر تحديد ترميز نص المحتويات.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "تعذر تحديد ترميز نص المحتويات.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "ربما يمكنك فتح الملف من خلال تحديد ترميز النص.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "تعذر فتح الملف \"%@\" نظرًا لتعذر تحديد ترميز نص المحتويات.";

/* NSUserCancelledError */
"Err3072-C" = "تم إلغاء العملية.";

/* NSPropertyListCorruptError */
"Err3840" = "لا يمكن قراءة البيانات لأنه تم إتلافها.";

/* NSPropertyListCorruptError */
"Err3840-C" = "تم إتلاف البيانات.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "لا يمكن قراءة البيانات لأن هذا التطبيق لا يستطيع تعريف تنسيقها.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "هذا التطبيق لا يستطيع تعريف تنسيق البيانات.";

/* NSPropertyListReadStreamError */
"Err3842" = "لا يمكن قراءة البيانات بسبب خطأ في مصدر البيانات.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "حدث خطأ في مصدر البيانات.";

/* NSPropertyListWriteStreamError */
"Err3851" = "لا يمكن كتابة البيانات بسبب خطأ في وجهة البيانات.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "حدث خطأ في وجهة البيانات.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "المجلد \"%@\" غير موجود.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "تعذرت إزالة \"%@\".";

/* NSFileNoSuchFileError */
"Err4-C" = "الملف غير موجود.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "المجلد غير موجود.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "الملف \"%@\" غير موجود.";

/* NSFileWriteUnknownError */
"Err512" = "تعذر حفظ الملف.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "تعذر حفظ الملف \"%1$@\" لأن ملف النسخة الاحتياطية لا يمكن تحديثه.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "تعذر نسخ \"%1$@\" إلى \"%2$@\".";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "تعذر ربط \"%1$@\" بـ \"%2$@\".";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "تعذر نسخ \"%1$@\" إلى \"%2$@\".";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "تعذرت إزالة \"%@\".";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "تعذر حفظ ملف النسخة الاحتياطية.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "ربما يكون ملف النسخة الاحتياطية مؤمّنًا، أو ربما لا يتوفر لديك الإذن لحفظه. لعرض الأذونات أو تغييرها، حدد العنصر في Finder وقم باختيار الملف ثم إحضار المعلومات.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "تعذر حفظ الملف \"%2$@\" في المجلد \"%1$@\".";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "تعذر حفظ الملف \"%@\".";

/* NSFileWriteNoPermissionError */
"Err513" = "تعذر حفظ الملف لأنه لا يوجد لديك الإذن.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "تعذر نسخ \"%1$@\" لأنه لا يتوفر لديك الإذن بالوصول إلى \"%2$@\".";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "تعذر ربط \"%1$@\" لأنه لا يتوفر لديك الإذن بالوصول إلى \"%2$@\".";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "تعذر نقل \"%1$@\" لأنه لا يتوفر لديك الإذن بالوصول إلى \"%2$@\".";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "تعذرت إزالة \"%@\" لأنه لا يتوفر لديك الإذن بالوصول إليه.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "لا يتوفر لديك الإذن.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "لعرض الأذونات أو تغييرها، حدد العنصر في Finder وقم باختيار الملف ثم إحضار المعلومات.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "لا يتوفر لديك الإذن اللازم لحفظ ملف \"%2$@\" داخل مجلد \"%1$@\".";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "لا يتوفر لديك الإذن اللازم لحفظ ملف \"%@\".";

/* NSFileWriteInvalidFileNameError */
"Err514" = "تعذر حفظ العنصر نظرًا لأن اسم الملف غير صالح.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "تعذرت إزالة العنصر نظرًا لأن اسم الملف \"%@\" غير صالح.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "اسم الملف غير صالح.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "تعذر حفظ العنصر نظرًا لأن اسم الملف \"%@\"غير صالح.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "تعذر حفظ الملف باستخدام ترميز النص المحدد.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "ترميز النص المحدد غير قابل للتطبيق.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "ترميز النص %@ غير قابل للتطبيق.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "إذا أمكن، قم بتحديد ترميز نص آخر.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "تعذر حفظ الملف باستخدام ترميز النص %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "تعذر حفظ الملف \"%2$@\" باستخدام ترميز النص %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "تعذر حفظ الملف حيث إن نوع عنوان URL المحدد غير مدعوم.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "نوع عنوان URL المحدد غير مدعوم.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "تعذر حفظ الملف \"%1$@\" نظرًا لأن نوع عنوان URL المتمثل في %2$@ غير مدعوم.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "تعذر حفظ الملف حيث إن نوع عنوان URL %@ غير مدعوم.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "تعذر حفظ الملف حيث لا توجد مساحة كافية.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "تعذر نسخ \"%1$@\" إلى \"%2$@\" نظرًا لعدم توفر مساحة كافية.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "تعذر ربط \"%1$@\" بـ \"%2$@\" نظرًا لعدم توفر مساحة كافية.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "تعذر نقل \"%1$@\" إلى \"%2$@\" نظرًا لعدم توفر مساحة كافية.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "لا توجد مساحة كافية.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "نفذت المساحة الخالية على وحدة التخزين \"%@\".";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "قم بإزالة بعض الملفات من وحدة التخزين، وحاول مرة أخرى.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "لا يمكن حفظ الملف \"%@\" حيث لا توجد مساحة كافية.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "لا يمكن حفظ الملف \"%1$@\" حيث نفذت المساحة الخالية على وحدة التخزين \"%2$@\".";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "تعذر حفظ الملف لأن وحدة التخزين للقراءة فقط.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "وحدة التخزين للقراءة فقط.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "وحدة التخزين \"%@\" للقراءة فقط.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "حاول حفظ الملف على وحدة تخزين أخرى.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "لا يمكن حفظ الملف \"%@\" حيث وحدة التخزين للقراءة فقط.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "لا يمكن حفظ الملف \"%1$@\" حيث وحدة التخزين \"%2$@\" للقراءة فقط.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "تعذر إكمال العملية. (خطأ %2$ld في %1$@.)";

